teachers_aide_app_api/app/controllers/grades_controller.rb

SELECT "grades".* FROM "grades"
---
  def index
    @grades = Grade.all

INSERT INTO "grades" ("student_grade", "teacher_id", "lesson_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["student_grade", 1], ["teacher_id", 1], ["lesson_id", 1], ["student_id", 1], ["created_at", "2019-09-10 19:30:13.934942"], ["updated_at", "2019-09-10 19:30:13.934942"]]
---
  def create
    @grade = Grade.new(grade_params)
    puts grade_params

    if @grade.save

SELECT "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_grade
      @grade = Grade.find(params[:id])