teachers_aide_app_api/app/controllers/lessons_controller.rb

INSERT INTO "lessons" ("lesson_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["lesson_name", "Converting customary units of length"], ["created_at", "2019-09-10 18:24:04.048913"], ["updated_at", "2019-09-10 18:24:04.048913"]]
---
  def create
    @lesson = Lesson.new(lesson_params)

    if @lesson.save

DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 2]]
---
  def destroy
    @lesson.destroy