teachers_aide_app_api/app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Alex"], ["last_name", "Gomes"], ["created_at", "2019-09-10 18:57:35.147855"], ["updated_at", "2019-09-10 18:57:35.147855"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save