teachers_aide_app_api/app/controllers/teachers_controller.rb

INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Morrison"], ["created_at", "2019-09-10 16:21:20.987121"], ["updated_at", "2019-09-10 16:21:20.987121"]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    if @teacher.save

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 8]]
---
  def destroy
    @teacher.destroy